package com.example.alhamdulillah;

import android.net.*;
import android.os.*;

import androidx.fragment.app.Fragment;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.github.barteksc.pdfviewer.*;

import java.io.*;
import java.util.*;


public class GreenKoranFragment extends Fragment {
    private ArrayList<KoranItemContent> suresName = new ArrayList<KoranItemContent>();
    private String[] sures = new String[115];
    private Integer[] numPageSures = new Integer[]{4, 5, 53, 80, 109, 131, 154, 180, 190, 211, 224, 328, 252, 258, 265, 270, 285, 296, 308, 315, 325, 335,
    345, 353, 362, 370, 380, 388, 399, 407, 414, 418, 421, 431, 437, 443, 449, 456, 461, 470, 480, 486, 492, 499, 502, 505, 510, 514, 518, 521, 523, 526,
    529, 531, 534, 537, 540, 545, 548, 552, 554, 556, 557, 559, 661, 563, 565, 567, 569, 571, 573, 575, 577, 578, 580, 581, 583, 585, 586, 588, 589, 590,
    590, 592, 593, 594, 594, 595, 596, 597, 598, 598, 599, 599, 600, 600, 601, 601, 602, 602, 603, 603, 604, 604, 604, 605, 605, 605, 606, 606, 606, 607,
    607, 607, 608};
    private HashMap <Integer, KoranItemContent> hashKoran = new HashMap<>();
//    Integer - номер суры

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.fragment_green_koran, null);

        PDFView pdfView = view.findViewById(R.id.pdfView);
        File file = new File(Environment.getExternalStorageDirectory()+"/Download/","GreenQuran.pdf");
        Uri path  = Uri.fromFile(file);
        pdfView.fromUri(path).load();

        return view;
    }

    private void initContent() {
        // Инициализация массива
        sures[0] = "Сура 1: «Аль-Фатиха» («Открывающая Книгу»)";
        sures[1] = "Сура 2: «Аль-Бакара» («Корова»)";
        sures[2] = "Сура 3: «Аль-Имран» («Семейство Имрана»)";
        sures[3] = "Сура 4: «Ан-Ниса» («Женщины»)";
        sures[4] = "Сура 5: «Аль-Маида» («Трапеза»)";
        sures[5] = "Сура 6: «Аль-Анам» («Скот»)";
        sures[6] = "Сура 7: «Аль-Араф» («Преграды»)";
        sures[7] = "Сура 8: «Аль-Анфаль» («Трофеи»)";
        sures[8] = "Сура 9: «Ат-Тауба» («Покаяние»)";
        sures[9] = "Сура 10: «Йунус» («Иона»)";
        sures[10] = "Сура 11: «Худ» («Худ»)";
        sures[11] = "Сура 12: «Йусуф» («Иосиф»)";
        sures[12] = "Сура 13: «Ар-Раад» («Гром»)";
        sures[13] = "Сура 14: «Ибрахим» («Авраам»)";
        sures[14] = "Сура 15: «Аль-Хиджр» («Хиджр»)";
        sures[15] = "Сура 16: «Ан-Нахль» («Пчёлы»)";
        sures[16] = "Сура 17: «Аль-Исра» («Ночной перенос»)";
        sures[17] = "Сура 18: «Аль-Кахф» («Пещера»)";
        sures[18] = "Сура 19: «Марьям» («Мария»)";
        sures[19] = "Сура 20: «Та Ха» («Та Ха»)";
        sures[20] = "Сура 21: «Аль-Анбийа» («Пророки»)";
        sures[21] = "Сура 22: «Аль-Хаджж» («Паломничество»)";
        sures[22] = "Сура 23: «Аль-Муминун» («Верующие»)";
        sures[23] = "Сура 24: «Ан-Нур» («Свет»)";
        sures[24] = "Сура 25: «Аль-Фуркан» («Различение»)";
        sures[25] = "Сура 26: «Аш-Шуара» («Поэты»)";
        sures[26] = "Сура 27: «Ан-Намль» («Муравьи»)";
        sures[27] = "Сура 28: «Аль-Касас» («Рассказ»)";
        sures[28] = "Сура 29: «Аль-Анкабут» («Паук»)";
        sures[29] = "Сура 30: «Ар-Рум» («Римляне»)";
        sures[30] = "Сура 31: «Лукман» («Лукман»)";
        sures[31] = "Сура 32: «Ас-Саджда» («Поклон»)";
        sures[32] = "Сура 33: «Аль-Ахзаб» («Сонмы»)";
        sures[33] = "Сура 34: «Саба» («Саба»)";
        sures[34] = "Сура 35: «Фатыр» («Ангелы»)";
        sures[35] = "Сура 36: «Ясин» («Йа Син»)";
        sures[36] = "Сура 37: «Ас-Саффат» («Стоящие в ряд»)";
        sures[37] = "Сура 38: «Сад» («Сад»)";
        sures[38] = "Сура 39: «Аз-Зумар» («Толпы»)";
        sures[39] = "Сура 40: «Гафир» («Прощающий»)";
        sures[40] = "Сура 41: «Фуссилат» («Разъяснены»)";
        sures[41] = "Сура 42: «Аш-Шура» («Совет»)";
        sures[42] = "Сура 43: «Аз-Зухруф» («Украшения»)";
        sures[43] = "Сура 44: «Ад-Духан» («Дым»)";
        sures[44] = "Сура 45: «Аль-Джасия» («Коленопреклонённые»)";
        sures[45] = "Сура 46: «Аль-Ахкаф» («Пески»)";
        sures[46] = "Сура 47: «Мухаммад» («Мухаммад»)";
        sures[47] = "Сура 48: «Аль-Фатх» («Победа»)";
        sures[48] = "Сура 49: «Аль-Худжурат» («Комнаты»)";
        sures[49] = "Сура 50: «Каф» («Каф»)";
        sures[50] = "Сура 51: «Аз-Зарият» («Рассеивающие»)";
        sures[51] = "Сура 52: «Ат-Тур» («Гора»)";
        sures[52] = "Сура 53: «Ан-Наджм» («Звезда»)";
        sures[53] = "Сура 54: «Аль-Камар» («Месяц»)";
        sures[54] = "Сура 55: «Ар-Рахман» («Милосердный»)";
        sures[55] = "Сура 56: «Аль-Вакиа» («Падающее»)";
        sures[56] = "Сура 57: «Аль-Хадид» («Железо»)";
        sures[57] = "Сура 58: «Аль-Муджадила» («Препирательство»)";
        sures[58] = "Сура 59: «Аль-Хашр» («Собрание»)";
        sures[59] = "Сура 60: «Аль-Мумтахана» («Испытуемая»)";
        sures[60] = "Сура 61: «Ас-Сафф» («Ряды»)";
        sures[61] = "Сура 62: «Аль-Джума» («Пятница»)";
        sures[62] = "Сура 63: «Аль-Мунафикун» («Лицемеры»)";
        sures[63] = "Сура 64: «Ат-Тагабун» («Взаимное обманывание»)";
        sures[64] = "Сура 65: «Ат-Талак» («Развод»)";
        sures[65] = "Сура 66: «Ат-Тахрим» («Запрещение»)";
        sures[66] = "Сура 67: «Аль-Мульк» («Власть»)";
        sures[67] = "Сура 68: «Аль-Калям» («Письменная трость»)";
        sures[68] = "Сура 69: «Аль-Хакка» («Неизбежное»)";
        sures[69] = "Сура 70: «Аль-Мааридж» («Ступени»)";
        sures[70] = "Сура 71: «Нух» («Нух»)";
        sures[71] = "Сура 72: «Аль-Джинн» («Джинны»)";
        sures[72] = "Сура 73: «Аль-Муззаммиль» («Закутавшийся»)";
        sures[73] = "Сура 74: «Аль-Муддассир» («Завернувшийся»)";
        sures[74] = "Сура 75: «Аль-Кийама» («Воскресение»)";
        sures[75] = "Сура 76: «Аль-Инсан» («Человек»)";
        sures[76] = "Сура 77: «Аль-Мурсалят» («Посылаемые»)";
        sures[77] = "Сура 78: «Ан-Наба» («Весть»)";
        sures[78] = "Сура 79: «Ан-Назиат» («Вырывающие»)";
        sures[79] = "Сура 80: «Абаса» («Нахмурился»)";
        sures[80] = "Сура 81: «Ат-Таквир» («Скручивание»)";
        sures[81] = "Сура 82: «Аль-Инфитар» («Раскалывание»)";
        sures[82] = "Сура 83: «Аль-Мутаффифин» («Обвешивающие»)";
        sures[83] = "Сура 84: «Аль-Иншикак» («Разверзнется»)";
        sures[84] = "Сура 85: «Аль-Бурудж» («Башни»)";
        sures[85] = "Сура 86: «Ат-Тарик» («Ночной путник»)";
        sures[86] = "Сура 87: «Аль-Аля» («Высочайший»)";
        sures[87] = "Сура 88: «Аль-Гашия» («Покрывающее»)";
        sures[88] = "Сура 89: «Аль-Фаджр» («Заря»)";
        sures[89] = "Сура 90: «Аль-Балад» («Город»)";
        sures[90] = "Сура 91: «Аш-Шамс» («Солнце»)";
        sures[91] = "Сура 92: «Аль-Лайл» («Ночь»)";
        sures[92] = "Сура 93: «Ад-Духа» («Утро»)";
        sures[93] = "Сура 94: «Аш-Шарх» («Раскрытие»)";
        sures[94] = "Сура 95 «Ат-Тин» («Смоковница»)";
        sures[95] = "Сура 96: «Аль-Алак» («Сгусток»)";
        sures[96] = "Сура 97: «Аль-Кадр» («Могущество»)";
        sures[97] = "Сура 98: «Аль-Баййина» («Ясное знамение»)";
        sures[98] = "Сура 99: «Аз-Залзала» («Землетрясение»)";
        sures[99] = "Сура 100: «Аль-Адият» («Скачущие»)";
        sures[100] = "Сура 101: «Аль-Кари’а» («Поражающее»)";
        sures[101] = "Сура 102: «Ат-Такасур» («Приумножение»)";
        sures[102] = "Сура 103: «Аль-Аср» («Предвечернее время»)";
        sures[103] = "Сура 104: «Аль-Хумаза» («Хулитель»)";
        sures[104] = "Сура 105: «Аль-Филь» («Слон»)";
        sures[105] = "Сура 106: «Курайш» («Курайшиты»)";
        sures[106] = "Сура 107: «Аль-Маун» («Милостыня»)";
        sures[107] = "Сура 108: «Аль-Каусар» («Изобилие»)";
        sures[108] = "Сура 109: «Аль-Кафирун» («Неверующие»)";
        sures[109] = "Сура 110: «Ан-Наср» («Помощь»)";
        sures[110] = "Сура 111: «Аль-Масад» («Пальмовые волокна»)";
        sures[111] = "Сура 112: «Аль-Ихлас» («Очищение веры»)";
        sures[112] = "Сура 113: «Аль-Фаляк» («Рассвет»)";
        sures[113] = "Сура 114: «Ан-Нас» («Люди»)";
    }

    private void initMap() {
        // Инициализация HashMap
        for (Map.Entry<Integer, KoranItemContent> entry : hashKoran.entrySet()) {
            suresName.add(new KoranItemContent(entry.getValue().getTitle(), entry.getValue().getNumSure(), entry.getValue().getPageNumber()));
        }
    }


}